Revit 2021.1 API
Entity.Set Method
Overload List
Name | Description
Set<FieldType>(String, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, DisplayUnitType) |  Obsolete.
 Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, ForgeTypeId)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, DisplayUnitType) |  Obsolete.
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, ForgeTypeId)
 Stores the value of the field in the entity.
See Also
Entity Class
Entity Members
Autodesk.Revit.DB.ExtensibleStorage Namespace